app/controllers/rules_controller.rb

  def index
    @rules = Rule.all
---
SELECT "rules".* FROM "rules"

  def show
    @rule = Rule.find(params[:id])
---
SELECT "rules".* FROM "rules" WHERE "rules"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @rule = Rule.new(rule_params)
    if @rule.save
---
INSERT INTO "rules" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "uuuuuuuuuu"], ["body", "jhhhhhhhhhhhhjh"], ["created_at", "2024-04-23 06:19:40.248671"], ["updated_at", "2024-04-23 06:19:40.248671"]]